# DataFrame 전처리

In [3]:
# ! pip install cx-Oracle
import pandas as pd
import numpy as np
import cx_Oracle
from datetime import datetime

* Warning(경고) 핑크박스 안나오게 할 경우 사용

In [1]:
import warnings
warnings.filterwarnings(action='ignore')

## 오라클(DB) 연동해서 DataFrame 생성

In [4]:
conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
if bool(conn) :
    print("연결성공")
else:
    print("연결실패")
conn.close()

연결성공

In [5]:
# pd.read_csv('./lec08_emp.csv' , sep ='\t') #csv파일 옮기기 귀찮
# df = pd.read_csv('./lec08_emp.csv' , sep =',', parse_dates=['HIREDATE'])

conn= cx_Oracle.connect('ai','0000','localhost:1521/XE')
df = pd.read_sql('select * from emp ',conn)
conn.close() # 항상 close 해주는게 중요

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPNO     14 non-null     int64
 1   ENAME     14 non-null     object
 2   JOB       14 non-null     object
 3   MGR       13 non-null     float64
 4   HIREDATE  14 non-null     datetime64[ns]
 5   SAL       14 non-null     float64
 6   COMM      4 non-null      float64
 7   DEPTNO    14 non-null     int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(2)
memory usage: 1.0+ KB

## 날짜처리(숫자를 날짜로 변환)

### astype()

* 데이터프레임 타입 변경

In [9]:
df['HIREDATE'].astype('datetime64[ns]')

0    1980-12-17
1    1981-02-20
2    1981-02-22
3    1981-04-02
4    1981-09-28
5    1981-05-01
6    1981-06-09
7    1987-07-13
8    1981-11-17
9    1981-09-08
10   1987-07-13
11   1981-12-03
12   1981-12-03
13   1982-01-23
Name: HIREDATE, dtype: datetime64[ns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPNO     14 non-null     int64
 1   ENAME     14 non-null     object
 2   JOB       14 non-null     object
 3   MGR       13 non-null     float64
 4   HIREDATE  14 non-null     datetime64[ns]
 5   SAL       14 non-null     float64
 6   COMM      4 non-null      float64
 7   DEPTNO    14 non-null     int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(2)
memory usage: 1.0+ KB

## 컬럼명을 소문자로 바꿈
(편하게 사용하기위해)

In [118]:
df.columns=df.columns.str.lower()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   empno     14 non-null     int64
 1   ename     14 non-null     object
 2   job       14 non-null     object
 3   mgr       13 non-null     float64
 4   hiredate  14 non-null     datetime64[ns]
 5   sal       14 non-null     float64
 6   comm      4 non-null      float64
 7   deptno    14 non-null     int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(2)
memory usage: 1.0+ KB

## 결측(missing value)처리 
* np.nan
* df.dropna(axis = 1 또는 axis = 0)
* df.fillna(값)
* df.isna()

* <font color= 'red'><b> 숫자값에 NaN이 있으면 타입은 float(소숫점)

In [21]:
dfcp = df.copy()
dfcp.head(1)

   empno  ename    job     mgr   hiredate    sal  comm  deptno
0   7369  SMITH  CLERK  7902.0 1980-12-17  800.0   NaN      20

### dropna()
* axis = 0 : 결측이 있으면 행을 지움
* axis = 1 : 결측이 있으면 열을 지움

In [22]:
dfcp = df.copy()
dfcp.dropna(axis = 0,inplace=True)
dfcp

   empno   ename       job     mgr   hiredate     sal    comm  deptno
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
9   7844  TURNER  SALESMAN  7698.0 1981-09-08  1500.0     0.0      30

In [24]:
dfcp = df.copy()
dfcp = dfcp.dropna(axis = 1) # 결측값이 있는 열을 없앰
dfcp.shape # mgr, comm 칼럼이 삭제됨

(14, 6)

### fillna(inplace = True)

- 일반적으로 결측값을 .fillna(바꿀값) 처리 후 int로 형변환 한다.
- 결측값이 있으면 float 형태
- 형변환 : .astype('타입')
 <br><b>df['col'] = df['col'].astype('int')

In [25]:
dfcp = df.copy()
dfcp = dfcp.fillna(999999) #결측값을 999999로 변경
dfcp.head(3)

   empno  ename       job     mgr   hiredate     sal      comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800.0  999999.0      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600.0     300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250.0     500.0      30

In [41]:
dfcp = df.copy()

# dfcp[['comm','mgr']] = dfcp[['comm','mgr']].fillna(0)  # 같은 값으로 결측처리할 경우

dfcp['comm'] = dfcp['comm'].fillna(8888) # 결측 처리
dfcp['mgr'] = dfcp['mgr'].fillna(77) # 결측 처리

dfcp[['comm','mgr']] = dfcp[['comm','mgr']].astype('int') # float(결측)->int
dfcp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   empno     14 non-null     int64
 1   ename     14 non-null     object
 2   job       14 non-null     object
 3   mgr       14 non-null     int32
 4   hiredate  14 non-null     datetime64[ns]
 5   sal       14 non-null     float64
 6   comm      14 non-null     int32
 7   deptno    14 non-null     int64
dtypes: datetime64[ns](1), float64(1), int32(2), int64(2), object(2)
memory usage: 912.0+ bytes

### df.isna()

In [52]:
dfcp = df.copy()
dfcp[dfcp['comm'].isna()] # pandas꺼
# 또는 pd.isna(dfcp)
# 또는 dfcp.isnull() -> numpy꺼

    empno   ename        job     mgr   hiredate     sal  comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0   NaN      20
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0   NaN      20
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0   NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0   NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000.0   NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0   NaN      10
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100.0   NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0   NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0   NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0   NaN      10

In [28]:
dfcp.notna() # dfcp.isna()의 반대
dfcp.notnull() # dfcp.isnull()의 반대

    EMPNO  ENAME   JOB    MGR  HIREDATE   SAL   COMM  DEPTNO
0    True   True  True   True      True  True  False    True
1    True   True  True   True      True  True   True    True
2    True   True  True   True      True  True   True    True
3    True   True  True   True      True  True  False    True
4    True   True  True   True      True  True   True    True
5    True   True  True   True      True  True  False    True
6    True   True  True   True      True  True  False    True
7    True   True  True   True      True  True  False    True
8    True   True  True  False      True  True  False    True
9    True   True  True   True      True  True   True    True
10   True   True  True   True      True  True  False    True
11   True   True  True   True      True  True  False    True
12   True   True  True   True      True  True  False    True
13   True   True  True   True      True  True  False    True

* 결측값이 몇개인지 합계를 봄

In [65]:
dfcp.isna().sum()

empno        0
ename        0
job          0
mgr          1
hiredate     0
sal          0
comm        10
deptno       0
dtype: int64

# 값의 변경

## loc[  ,  ], iloc[  , ]

- df.loc[행 **값**, 열 **값** ]
- df.iloc[행 **인덱스**, 열 **인덱스**]
    - 단일 [,]
    - 리스트 [[ , , , , ,]]
    - 슬라이싱 [  : ,   : ]

In [67]:
df.head()

   empno   ename       job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

### df.loc[]

In [72]:
df.loc[4]

empno                      7654
ename                    MARTIN
job                    SALESMAN
mgr                      7698.0
hiredate    1981-09-28 00:00:00
sal                      1250.0
comm                     1400.0
deptno                       30
Name: 4, dtype: object

In [69]:
df.loc[4,'empno'] #값으로 꺼냄

7654

In [88]:
df.loc[[4,8],'empno':'job']

   empno   ename        job
4   7654  MARTIN   SALESMAN
8   7839    KING  PRESIDENT

In [87]:
df.loc[4:6,['empno','ename']]

   empno   ename
4   7654  MARTIN
5   7698   BLAKE
6   7782   CLARK

### df.iloc[]

In [73]:
df.iloc[4] #4번째 행의 값들

empno                      7654
ename                    MARTIN
job                    SALESMAN
mgr                      7698.0
hiredate    1981-09-28 00:00:00
sal                      1250.0
comm                     1400.0
deptno                       30
Name: 4, dtype: object

In [77]:
df.iloc[[4,6,10]] #4,6,10행

    empno   ename       job     mgr   hiredate     sal    comm  deptno
4    7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
6    7782   CLARK   MANAGER  7839.0 1981-06-09  2450.0     NaN      10
10   7876   ADAMS     CLERK  7788.0 1987-07-13  1100.0     NaN      20

In [80]:
df.iloc[4:6] # 4행 ~5행

   empno   ename       job     mgr   hiredate     sal    comm  deptno
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5   7698   BLAKE   MANAGER  7839.0 1981-05-01  2850.0     NaN      30

In [74]:
df.iloc[4,0] #4행 0열

7654

In [82]:
df.iloc[4,5:7] #4행 5열, 4행 6열

sal     1250.0
comm    1400.0
Name: 4, dtype: object

In [83]:
df.iloc[[4,5,8],[1,2,3]]

    ename        job     mgr
4  MARTIN   SALESMAN  7698.0
5   BLAKE    MANAGER  7839.0
8    KING  PRESIDENT     NaN

In [84]:
df.iloc[4:6,1:5]

    ename       job     mgr   hiredate
4  MARTIN  SALESMAN  7698.0 1981-09-28
5   BLAKE   MANAGER  7839.0 1981-05-01

## df.at[] / df.iat[]

<pre>: 단일값 변경만 가능
: 여러개의 값 변경은 불가능하다
-> 여러값을 변경하고 싶을 경우 loc[]/iloc[]을 이용

In [112]:
dfdf=df.copy()
dfdf.at[4,'empno']=5555
print(dfdf.at[4,'empno'])
print(df.at[4,'empno'])

5555
7654

In [113]:
dfdf.iat[1,2] ='NOJOB'
print(dfdf.iat[1,2])
print(df.iat[1,2])

NOJOB
SALESMAN

# DataFrame에 조건걸기
1. df[ 조건 ]
2. df[ 컬럼 ]
3. df[조건][컬럼]
4. df[컬럼][조건]
5. np.where()

In [90]:
df['empno'].head()

0    7369
1    7499
2    7521
3    7566
4    7654
Name: empno, dtype: int64

In [91]:
df[df['empno']==7654]

   empno   ename       job     mgr   hiredate     sal    comm  deptno
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [94]:
df[df['job']=='SALESMAN']['ename']

1     ALLEN
2      WARD
4    MARTIN
9    TURNER
Name: ename, dtype: object

In [95]:
df[df['job']=='SALESMAN'][['ename','empno']]

    ename  empno
1   ALLEN   7499
2    WARD   7521
4  MARTIN   7654
9  TURNER   7844

## 멀티조건
- and: &
- or : |
- <pre>df[컬럼][  (      )  | (     ) & (     )  ]

* 부서번호가 10번이고 급여가 2000이상인 사원의 사원번호와 사원이름,급여를 출력

In [96]:
df[['empno','ename','sal']][(df['deptno']==10)&(df['sal']>=2000)]

   empno  ename     sal
6   7782  CLARK  2450.0
8   7839   KING  5000.0

### isin([    ])

In [97]:
df[df['job'].isin(['MANAGER', 'PRESIDENT', 'CLERK'])]['job']

0         CLERK
3       MANAGER
5       MANAGER
6       MANAGER
8     PRESIDENT
10        CLERK
11        CLERK
13        CLERK
Name: job, dtype: object

## np.where()

* <b>np.where(조건절 , 참일때 넣을 값,거짓일때 넣을 값 )</b> 
        <br>-> 추천(decode와 비슷)
* pd.where()
<br> df['컬럼'].where(조건문 , 거짓일때의 값)
<br> -> 조건을 만족하면 컬럼값 그렇지 않으면 거짓값

SQL : update empcp set job = 'SALES10' where deptno =10;

In [114]:
dfdf= df.copy()
dfdf['job']=np.where(dfdf['deptno']==10,'SALES10',dfdf['job'])
dfdf['job'][dfdf['deptno']==10]

6     SALES10
8     SALES10
13    SALES10
Name: job, dtype: object

## 정렬 
- .sort_values() / .sort_index()

- ['컬럼'].sort_values() -> 여기서 꺼낸 컬럼에 대해서만 정렬할수 있다.

### .sort_values(ascending = True or False)
- 값을 기준으로 오름차순(내림차순) 정렬

### .sort_index(ascending = True or False)
- 인덱스를 기준으로 오름차순(내림차순) 정렬

## 그룹(groupby())
* 그룹함수 : mean(), max(),min(), count(),sum(),std(), var()
<br>
<font color = 'red'><b>df.groupby(묶을 컬럼)[컬럼].count()

In [102]:
df.groupby('deptno')['deptno'].count()

deptno
10    3
20    5
30    6
Name: deptno, dtype: int64

In [107]:
df[['deptno']].value_counts().sort_index() # 위랑 같은결과

deptno
10        3
20        5
30        6
dtype: int64

In [106]:
df.groupby('deptno')['sal'].mean()

deptno
10    2916.666667
20    2175.000000
30    1566.666667
Name: sal, dtype: float64

### agg()
1. agg({'컬럼명1' : '그룹함수', '컬럼명2' : '그룹함수'})
2. 같은 컬럼에 다른 그룹함수를 쓰고싶을때는
 <br>: ['컬럼명'].agg(  ['그룹함수1', '그룹함수2', '그룹함수3']  )

In [108]:
dfdf=df.copy()
dfdf.head(3)

   empno  ename       job     mgr   hiredate     sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800.0    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600.0  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250.0  500.0      30

* 문제. 부서별 최대, 최소 급여를 출력
<br> 
SQL : select max(sal), min(sal) from emp group by deptno;

In [109]:
dfdf.groupby('deptno')['sal'].agg(['max','min'])

           max     min
deptno
10      5000.0  1300.0
20      3000.0   800.0
30      2850.0   950.0

* 문제. 부서별 급여의 최대값과 커미션의 최대값을 구하라 단 커미션에 null값은 0으로 한다.<br>
select max(sal), min(nvl(comm,0)) as new_comm from emp group by deptno;

In [110]:
dfdf['comm']=dfdf['comm'].fillna(0)
dfdf.groupby('deptno').agg({'sal':'max','comm':'max'})

           sal    comm
deptno
10      5000.0     0.0
20      3000.0     0.0
30      2850.0  1400.0

문제. 각 부서별 급여 합, 최대, 최소, 평균을 출력하라
<br>SQL : select sum(sal), max(sal), min(sal), avg(sal) from emp group by deptno;

In [111]:
dfdf.groupby('deptno')['sal'].agg(['sum','max','min','mean'])

            sum     max     min         mean
deptno
10       8750.0  5000.0  1300.0  2916.666667
20      10875.0  3000.0   800.0  2175.000000
30       9400.0  2850.0   950.0  1566.666667

# delete

* df.drop(<font color = 'red'><b>값</font>, axis =0(행 삭제) or axis =1(컬럼 삭제)),     -----> 데이터 행 / 컬럼 삭제
    <br>dropna(axis = 0 or 1)  -----> 데이터 행, 컬럼 삭제
* del df ----------> 데이터프레임 객체 삭제

In [124]:
df.drop(['job','mgr'],axis=1)

    empno   ename   hiredate     sal    comm  deptno
0    7369   SMITH 1980-12-17   800.0     NaN      20
1    7499   ALLEN 1981-02-20  1600.0   300.0      30
2    7521    WARD 1981-02-22  1250.0   500.0      30
3    7566   JONES 1981-04-02  2975.0     NaN      20
4    7654  MARTIN 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE 1981-05-01  2850.0     NaN      30
6    7782   CLARK 1981-06-09  2450.0     NaN      10
7    7788   SCOTT 1987-07-13  3000.0     NaN      20
8    7839    KING 1981-11-17  5000.0     NaN      10
9    7844  TURNER 1981-09-08  1500.0     0.0      30
10   7876   ADAMS 1987-07-13  1100.0     NaN      20
11   7900   JAMES 1981-12-03   950.0     NaN      30
12   7902    FORD 1981-12-03  3000.0     NaN      20
13   7934  MILLER 1982-01-23  1300.0     NaN      10

In [125]:
df.drop([12,13],axis=0)

    empno   ename        job     mgr   hiredate     sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30

In [115]:
del dfdf

In [126]:
del df

----